0.57.2119-1/InformationRegisters/ККСНГ_СобытияПодписок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ККСНГ_СобытияПодписок</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Date</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>DocumentId</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>TicketId</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>EventType</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>DocumentRelationType</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ExtendedTicketType</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>96</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>TicketType</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Обработано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Счетчик</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаЗагрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОбработки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Code</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>46</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Token</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Id</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

0.57.2119-1/Catalogs/ККСНГ_Организации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ККСНГ_Организации</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодУчастникаЭДО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>47</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторСК</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючДоступаAPI</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПодпискиСК</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантНастройкиОбмена</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ККСНГ_ЗначенияСвойствОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособАвторизации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ККСНГ_СпособыАвторизацииКурьер</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МногопользовательскийРежим</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодключаемыйМодуль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДополнительныеОтчетыИОбработки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбработчикПослеФормированияЭД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДополнительныеОтчетыИОбработки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантОтправкиМЧД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НастройкиДоступа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СпособАвторизации</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ККСНГ_СпособыАвторизацииКурьер</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пользователь1С</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючДоступаAPI</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>64</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

0.57.2119-1/CommonModules/ККСНГ_Подписки/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Получение событий из Курьера, используется фоновыми заданиями
//
// Параметры:
//	ПрофильНастройкиЭДО      - Справочник ККСНГ_Организации
//	АдресХранилища           - Строка - Адрес хранилища, в котором результат выполнения фонового задания
//	ПараметрыАвторизации     - Структура, см. ККСНГ_ДокументооборотКлиент.ПараметрыАвторизацииОрганизации() 
//
Процедура ПолучитьИОбработатьСобытияИзСфераКурьер(ПрофильНастройкиЭДО, АдресХранилища, ПараметрыАвторизации) Экспорт
	
	// Сообщаем адрес хранилища, по которому можно получить результат регламентного задания.
	// Необходимо, если задание было запущено в одном экземпляре формы, а результат его обрабатывается в другом.
	ККСНГ_ОбщегоНазначенияКлиентСервер.СообщитьПользователю(АдресХранилища);

	КодУчастникаЭДО = ПрофильНастройкиЭДО.КодУчастникаЭДО;
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета("Получение и обработка событий из сервиса ЭДО " + Строка(КодУчастникаЭДО));
			
	// Удаление старых событий по подпискам
	УдалениеСтарыхСобытий = УдалитьСтарыеСобытия(КодУчастникаЭДО);
	ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, УдалениеСтарыхСобытий.Журнал, Ложь);		
			
	// Получение данных о текущей подписке
	ЗапросТокенаПодписки = ПолучитьТокенПодписки(ПрофильНастройкиЭДО, ПараметрыАвторизации);
	ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросТокенаПодписки.Журнал, Ложь);

	Если ЗапросТокенаПодписки.Успех Тогда // Получение событий из Курьера и запись в РС
					
		СтруктураПодписки = ЗапросТокенаПодписки.Результат;
		ТокенПодписки = СтруктураПодписки.ТокенПодписки;

		ПереносСобытийЗавершен = РегистрыСведений.ККСНГ_Служебный.ПереносСобытийЗавершен(XMLСтрока(ПрофильНастройкиЭДО));
		
		Если СтруктураПодписки.ПодпискаОбновлена 
			ИЛИ НЕ ПереносСобытийЗавершен Тогда
			
			Если ПереносСобытийЗавершен Тогда
				РегистрыСведений.ККСНГ_Служебный.УстановитьПереносСобытийЗавершен(Ложь, XMLСтрока(ПрофильНастройкиЭДО));
			КонецЕсли;	
			
			ОбработкаСобытийСфераКурьер = ПолучитьИСохранитьСобытияИзЛенты(КодУчастникаЭДО, ПараметрыАвторизации, ТокенПодписки, 1000);
			
			Если ОбработкаСобытийСфераКурьер.Успех Тогда
				РегистрыСведений.ККСНГ_Служебный.УстановитьПереносСобытийЗавершен(Истина, XMLСтрока(ПрофильНастройкиЭДО));
			КонецЕсли;
			
		Иначе	
			ОбработкаСобытийСфераКурьер = ПолучитьИСохранитьСобытияИзПодписки(КодУчастникаЭДО, ПараметрыАвторизации, ТокенПодписки, 1000);	
		КонецЕсли;
					
		ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ОбработкаСобытийСфераКурьер.Журнал, Ложь);		
		
		Ответ.Успех = ОбработкаСобытийСфераКурьер.Успех;
	КонецЕсли;	
	
	// Обработка событий из РС
	ОбработкаРегистраСобытий = ОбработатьСобытияИзРегистра(КодУчастникаЭДО, ПараметрыАвторизации); 
	ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ОбработкаРегистраСобытий.Журнал, Ложь);
	
	Ответ.Успех = Ответ.Успех И ОбработкаРегистраСобытий.Успех;
	
	Если НЕ ПрофильНастройкиЭДО.МногопользовательскийРежим Тогда
		НазначениеДокументовБезмаршрута = НазначитьВходящиеДокументыБезМаршрута(КодУчастникаЭДО, ОбработкаРегистраСобытий.Результат, ПараметрыАвторизации);
		ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, НазначениеДокументовБезмаршрута.Журнал, Ложь);
		
		Ответ.Успех = Ответ.Успех И НазначениеДокументовБезмаршрута.Успех; 
	КонецЕсли;	
		
	ПоместитьВоВременноеХранилище(Ответ, АдресХранилища);
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Получение событий Курьера из подписки 
//
// Параметры:
//	КодУчастникаЭДО           - Строка
//	ПараметрыАвторизации      - Структура, см. ККСНГ_ДокументооборотКлиент.ПараметрыАвторизацииОрганизации()
//	ТокенПодписки             - Строка, см.ККСНГ_APIКурьер.v2_SubscriptionAdd()
//	РазмерПакета              - Число
//	ЛимитКоличестваСобытий    - Число
//
// Возвращаемое значение:
//	Структура, см.ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета()
//
Функция ПолучитьИСохранитьСобытияИзПодписки(КодУчастникаЭДО, ПараметрыАвторизации, ТокенПодписки, РазмерПакета = 100, 
																			ЛимитКоличестваСобытий = Неопределено) Экспорт
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета("Получение событий из подписки сервиса ЭДО");
	
	//РазмерПакета = 10;
	КоличествоЗагруженныхСобытий = 0;
	
	НадоПовторить = Истина;
	
	Пока НадоПовторить Цикл
		
		НадоПовторить = Ложь;
		
		ЗапросСобытий = ПолучитьИСохранитьСобытияИзПодпискиПакетом(КодУчастникаЭДО, ТокенПодписки, ПараметрыАвторизации, РазмерПакета);
		ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросСобытий.Журнал, Ложь);
		
		Если ЗапросСобытий.Успех Тогда
						
			Если ЛимитКоличестваСобытий = Неопределено Тогда
				ЛимитКоличестваСобытий = ЗапросСобытий.Результат.Всего;
			КонецЕсли;
			
			КоличествоЗагруженныхСобытий = КоличествоЗагруженныхСобытий + ЗапросСобытий.Результат.Количество;
			
			Если (КоличествоЗагруженныхСобытий < ЛимитКоличестваСобытий) И (ЗапросСобытий.Результат.Количество > 0) Тогда
				НадоПовторить = Истина;
			КонецЕсли;
						
		КонецЕсли;
		
	КонецЦикла;
		
	Возврат Ответ;
	
КонецФункции

// Получение событий Курьера из ленты 
//
// Параметры:
//	КодУчастникаЭДО           - Строка
//	ПараметрыАвторизации      - Структура, см. ККСНГ_ДокументооборотКлиент.ПараметрыАвторизацииОрганизации()
//	ТокенПодписки             - Строка, см.ККСНГ_APIКурьер.v2_SubscriptionAdd()
//	РазмерПакета              - Число
//
// Возвращаемое значение:
//	Структура, см.ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета()
//
Функция ПолучитьИСохранитьСобытияИзЛенты(КодУчастникаЭДО, ПараметрыАвторизации, ТокенПодписки, РазмерПакета = 100) Экспорт
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета("Получение событий из ленты сервиса ЭДО");
	IdСобытия = ПолучитьИдентификаторПоследнегоСобытия(КодУчастникаЭДО);
	
	Если IdСобытия = 0 Тогда
		ЗапросСобытияДокумента = ИдентификаторПервогоСобытияДокумента(КодУчастникаЭДО, ПараметрыАвторизации);
		ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросСобытияДокумента.Журнал, Ложь);
				
		Если ЗапросСобытияДокумента.Успех Тогда
			IdСобытия = ЗапросСобытияДокумента.Результат;
		КонецЕсли;
		Если IdСобытия = 0 Тогда
			Ответ.Успех = ЗапросСобытияДокумента.Успех;
			Возврат Ответ;
		КонецЕсли;
	КонецЕсли;	
	
	НадоПовторить = Истина;
		
	Пока НадоПовторить Цикл
			
		НадоПовторить = Ложь;
		
		ЗапросСобытий = ПолучитьИСохранитьСобытияНачинаяСЗаданного(КодУчастникаЭДО, ТокенПодписки, ПараметрыАвторизации, IdСобытия, РазмерПакета);
		ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросСобытий.Журнал, Ложь);
				
		Если ЗапросСобытий.Успех Тогда
			Если НЕ (ЗапросСобытий.Результат.Количество = ЗапросСобытий.Результат.Всего И ЗапросСобытий.Результат.Всего < РазмерПакета) Тогда
				НадоПовторить = Истина;
			КонецЕсли;
		КонецЕсли;				
	КонецЦикла;
	
	Ответ.Успех = ЗапросСобытий.Успех;
	
	Возврат Ответ;
	
КонецФункции

// Назначает документы себе в обработку
// См. https://confluence.esphere.ru/display/SBER/Document.SelfRoute
//
// Параметры:
//	КодУчастникаЭДО           - Строка
//	СписокДокументов          - Массив из Справочник.ККСНГ_ЭлектронныеДокументы
//	ПараметрыАвторизации      - Структура, см. ККСНГ_ДокументооборотКлиент.ПараметрыАвторизацииОрганизации()
//
// Возвращаемое значение:
//	Структура, см.ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета()
//
Функция НазначитьВходящиеДокументыБезМаршрута(КодУчастникаЭДО, СписокДокументов, ПараметрыАвторизации) Экспорт
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета("Назначение документов без маршрута " + Строка(КодУчастникаЭДО));	
	
	Если ТипЗнч(СписокДокументов) = Тип("Массив") Тогда
		
		ТекстЗапроса =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ККСНГ_ЭлектронныеДокументы.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ККСНГ_ЭлектронныеДокументы КАК ККСНГ_ЭлектронныеДокументы
		|ГДЕ
		|	ККСНГ_ЭлектронныеДокументы.КодЭДОВладельца = &КодУчастникаЭДО
		|	И ККСНГ_ЭлектронныеДокументы.BuyerCode = &КодУчастникаЭДО
		|	И ККСНГ_ЭлектронныеДокументы.Id В(&СписокДокументов)
		|	И ККСНГ_ЭлектронныеДокументы.Actions ПОДОБНО ""%AssignableToSelf%""";
		
		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.УстановитьПараметр("КодУчастникаЭДО", КодУчастникаЭДО);
		Запрос.УстановитьПараметр("СписокДокументов", СписокДокументов);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ККСНГ_ДокументооборотВызовСервера.КурьерAssignableToSelf(Выборка.Ссылка, Неопределено, ПараметрыАвторизации);
		КонецЦикла;
		
	КонецЕсли;

	Ответ.Успех = Истина;
	
	Возврат Ответ;

КонецФункции

// Выполнение необработанных событий Курьера из РС
//
// Параметры:
//	КодУчастникаЭДО           - Строка
//	ПараметрыАвторизации      - Структура, см. ККСНГ_ДокументооборотКлиент.ПараметрыАвторизацииОрганизации()
//
// Возвращаемое значение:
//	Структура, см.ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета()
//
Функция ОбработатьСобытияИзРегистра(КодУчастникаЭДО, ПараметрыАвторизации) Экспорт
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета("Обработка данных по событиям из регистра для " + Строка(КодУчастникаЭДО));	
	
	Ответ.Результат = Новый Массив;
	Ответ.Успех = Истина;
	
	ЗапросПоСобытиям = ПолучитьСобытияИзРегистраПоКодуУчастникаЭДО(КодУчастникаЭДО);	
	ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросПоСобытиям.Журнал, Ложь);
	
	Если ЗапросПоСобытиям.Успех Тогда
		
		ВыборкаИтоги = ЗапросПоСобытиям.Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Если ВыборкаИтоги.Следующий() Тогда
			
			ККСНГ_ЛогированиеКлиентСервер.ДобавитьИнформацию(Ответ.Журнал, "Найдено " + Строка(ВыборкаИтоги.Total) + " событий");
			
			ВыборкаПоДокументам = ВыборкаИтоги.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаПоДокументам.Следующий() Цикл
				
				Если ВыборкаПоДокументам.CreatedOnly Или ВыборкаПоДокументам.Deleted Тогда
					ОбновитьИнформациюРегистраПоВыборке(ВыборкаПоДокументам, Ответ);
				Иначе
					ОбновитьИнформациюРегистраИДокументыПоВыборке(ВыборкаПоДокументам, КодУчастникаЭДО, ПараметрыАвторизации, Ответ);	
				КонецЕсли; 
				
			КонецЦикла;
			
		Иначе
			ККСНГ_ЛогированиеКлиентСервер.ДобавитьИнформацию(Ответ.Журнал, "Событий не найдено");		
		КонецЕсли; 
		
	КонецЕсли; 
	
	Возврат Ответ;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
	
Функция ПолучитьТокенПодписки(ПрофильЭДООрганизации, ПараметрыАвторизации)
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета();
	
	ТокенПодписки = ПрофильЭДООрганизации.ИдентификаторПодпискиСК;
		
	ДействующаяПодписка = ККСНГ_ДокументооборотВызовСервера.ПолучитьИдентификаторПодписки(ТокенПодписки, ПараметрыАвторизации);
	ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ДействующаяПодписка.Журнал, Ложь);
	
	Если ДействующаяПодписка.Успех Тогда 
				
		СтруктураПодписки = Новый Структура;
		СтруктураПодписки.Вставить("ПодпискаОбновлена", ТокенПодписки <> ДействующаяПодписка.Результат);
		СтруктураПодписки.Вставить("ТокенПодписки", ДействующаяПодписка.Результат);
		
		Если СтруктураПодписки.ПодпискаОбновлена Тогда 
			Попытка
				ПрофильОбъект = ПрофильЭДООрганизации.ПолучитьОбъект();
				ПрофильОбъект.ИдентификаторПодпискиСК = ДействующаяПодписка.Результат;
				ПрофильОбъект.Записать();
				ККСНГ_ЛогированиеКлиентСервер.ДобавитьИнформацию(Ответ.Журнал, "Обновлена подписка профиля: " + ПрофильЭДООрганизации);
			Исключение
				ОписаниеОшибки = ОписаниеОшибки();
				ТекстОшибки = "Ошибка обновления идентификатора подписки в профиле " + ПрофильЭДООрганизации;
				ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, ТекстОшибки, "SB-00003", ОписаниеОшибки); 
			КонецПопытки;
			
		КонецЕсли;
		
		Ответ.Результат = СтруктураПодписки;
		Ответ.Успех = ДействующаяПодписка.Успех;
		
	КонецЕсли;	
				
	Возврат Ответ;
	
КонецФункции

Функция ПолучитьИдентификаторПоследнегоСобытия(КодУчастникаЭДО)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ККСНГ_СобытияПодписок.Code КАК Code,
	|	МАКСИМУМ(ККСНГ_СобытияПодписок.Id) КАК Id
	|ИЗ
	|	РегистрСведений.ККСНГ_СобытияПодписок КАК ККСНГ_СобытияПодписок
	|ГДЕ
	|	ККСНГ_СобытияПодписок.Code = &Code
	|
	|СГРУППИРОВАТЬ ПО
	|	ККСНГ_СобытияПодписок.Code";	
	
	Запрос.УстановитьПараметр("Code", КодУчастникаЭДО);
		
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		ВыборкаСобытий = Результат.Выбрать();
		ВыборкаСобытий.Следующий();
		
		Возврат ВыборкаСобытий.Id;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции

#Область ПолучениеИдентификатораСобытияДокумента

Функция ИдентификаторПервогоСобытияДокумента(КодУчастникаЭДО, ПараметрыАвторизации)
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета();	
	ИДПервогоСобытия = 0;
	
	ИДИсходящегоДокумента = ИдентификаторПервогоИсходящегоДокументаСоСтатусом(КодУчастникаЭДО, "Prepared");	
	ИДВходящегоДокумента = ИдентификаторПоследнегоВходящегоДокумента(КодУчастникаЭДО);
	// При определении минимального ИД, если один ИД = 0, то берем другой.
	ИДИсходящегоДокумента = ?(ИДИсходящегоДокумента = 0, ИДВходящегоДокумента, ИДИсходящегоДокумента);
	ИДВходящегоДокумента = ?(ИДВходящегоДокумента = 0, ИДИсходящегоДокумента, ИДВходящегоДокумента);
	ИДДокументаСобытия = Мин(ИДИсходящегоДокумента, ИДВходящегоДокумента);
	
	Если ИДДокументаСобытия > 0 Тогда
		
		ЗапросСобытийДокумента = ККСНГ_APIКурьер.v1_getDocumentEvents(ПараметрыАвторизации, ИДДокументаСобытия);
		ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросСобытийДокумента.Журнал, Ложь);
		Ответ.Успех = ЗапросСобытийДокумента.Успех;
		
		Если ЗапросСобытийДокумента.Успех Тогда
			СобытияДокумента = ЗапросСобытийДокумента.Результат.DocumentEvent;
			Для каждого ТекСобытие Из СобытияДокумента Цикл
				Если ИДПервогоСобытия = 0 Тогда
					ИДПервогоСобытия = ТекСобытие.Id;
				КонецЕсли;
				ИДПервогоСобытия = Мин(ТекСобытие.Id, ИДПервогоСобытия);
			КонецЦикла;
		КонецЕсли;
		
	Иначе 
		Ответ.Успех = Истина;
	КонецЕсли;	
	Если ИДПервогоСобытия > 0 Тогда
		// Чтобы прочитать само первое событие документа (для полноты истории обработки).
		ИДПервогоСобытия = ИДПервогоСобытия - 1;
	КонецЕсли;
	Ответ.Результат = ИДПервогоСобытия;
		
	Возврат Ответ;
	
КонецФункции

Функция ИдентификаторПервогоИсходящегоДокументаСоСтатусом(КодУчастникаЭДО, Статус)
	
	ИДИсходящегоДокумента = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МИНИМУМ(ККСНГ_ЭлектронныеДокументы.Id) КАК Id
	|ИЗ
	|	Справочник.ККСНГ_Организации КАК ККСНГ_Организации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ККСНГ_ЭлектронныеДокументы КАК ККСНГ_ЭлектронныеДокументы
	|		ПО ККСНГ_Организации.КодУчастникаЭДО = ККСНГ_ЭлектронныеДокументы.КодЭДОВладельца
	|			И ККСНГ_Организации.ИдентификаторСК = ККСНГ_ЭлектронныеДокументы.SenderId
	|ГДЕ
	|	ККСНГ_Организации.КодУчастникаЭДО = &КодУчастникаЭДО
	|	И ККСНГ_ЭлектронныеДокументы.Status = &Status";	
	
	Запрос.УстановитьПараметр("КодУчастникаЭДО", КодУчастникаЭДО);
	Запрос.УстановитьПараметр("Status", Статус);
		
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		ВыборкаДокументов = Результат.Выбрать();
		ВыборкаДокументов.Следующий();
				
		Если ЗначениеЗаполнено(ВыборкаДокументов.Id) Тогда
			ИДИсходящегоДокумента = ВыборкаДокументов.Id;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ИДИсходящегоДокумента;
	
КонецФункции

Функция ИдентификаторПоследнегоВходящегоДокумента(КодУчастникаЭДО)
	
	ИДВходящегоДокумента = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 	
	"ВЫБРАТЬ
	|	МАКСИМУМ(ККСНГ_ЭлектронныеДокументы.Id) КАК Id
	|ИЗ
	|	Справочник.ККСНГ_Организации КАК ККСНГ_Организации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ККСНГ_ЭлектронныеДокументы КАК ККСНГ_ЭлектронныеДокументы
	|		ПО ККСНГ_Организации.КодУчастникаЭДО = ККСНГ_ЭлектронныеДокументы.КодЭДОВладельца
	|			И ККСНГ_Организации.ИдентификаторСК = ККСНГ_ЭлектронныеДокументы.ReceiverId
	|ГДЕ
	|	ККСНГ_Организации.КодУчастникаЭДО = &КодУчастникаЭДО";
	
	Запрос.УстановитьПараметр("КодУчастникаЭДО", КодУчастникаЭДО);
		
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		ВыборкаДокументов = Результат.Выбрать();
		ВыборкаДокументов.Следующий();
		
		Если ЗначениеЗаполнено(ВыборкаДокументов.Id) Тогда
			ИДВходящегоДокумента = ВыборкаДокументов.Id;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ИДВходящегоДокумента;
	
КонецФункции

// ПолучениеИдентификатораСобытияДокумента
#КонецОбласти

Функция ЗаписатьСобытиеПодписки(Знач КодУчастникаЭДО, Знач ТокенПодписки, Знач Id, Событие = Неопределено, Обработано = Неопределено, Комментарий = "")
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета();
	
	Попытка
		МенеджерЗаписи = РегистрыСведений.ККСНГ_СобытияПодписок.СоздатьМенеджерЗаписи();
		
		МенеджерЗаписи.Code = КодУчастникаЭДО;
		МенеджерЗаписи.Token = ТокенПодписки;
		МенеджерЗаписи.Id = Id;
		
		МенеджерЗаписи.Прочитать();
		
		Если МенеджерЗаписи.Выбран() Тогда
			
			Если Обработано <> Неопределено Тогда
				МенеджерЗаписи.Обработано = Обработано;
				МенеджерЗаписи.Счетчик = МенеджерЗаписи.Счетчик + 1;
				МенеджерЗаписи.Комментарий = Комментарий;
				МенеджерЗаписи.Записать();
			КонецЕсли;
			
		Иначе
			МенеджерЗаписи.Code = КодУчастникаЭДО;
			МенеджерЗаписи.Token = ТокенПодписки;
			МенеджерЗаписи.Id = Id;
			
			Если Событие <> Неопределено Тогда
				ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Событие);
			КонецЕсли;
			
			МенеджерЗаписи.Комментарий = Комментарий;		
			МенеджерЗаписи.Записать();
		КонецЕсли;
		
		Ответ.Успех = Истина;
		
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
		ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, "Ошибка записи события подписки по участнику " + КодУчастникаЭДО, "SB-00004", ОписаниеОшибки); 		
	КонецПопытки;	
	
	Возврат Ответ;
	
КонецФункции

Функция УдалитьСтарыеСобытия(КодУчастникаЭДО)
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета("Удаление старых событий подписки " + Строка(КодУчастникаЭДО));	
	Ответ.Успех = Истина;
	Ответ.Результат = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ККСНГ_СобытияПодписок.Code КАК Code,
	|	ККСНГ_СобытияПодписок.Id КАК Id,
	|	ККСНГ_СобытияПодписок.Token КАК Token
	|ИЗ
	|	РегистрСведений.ККСНГ_СобытияПодписок КАК ККСНГ_СобытияПодписок
	|ГДЕ
	|	ККСНГ_СобытияПодписок.Code = &Code
	|	И ККСНГ_СобытияПодписок.Id < &IdПоследнегоСобытия
	|	И ВЫБОР ККСНГ_СобытияПодписок.ДатаЗагрузки
	|			КОГДА ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА ВЫБОР
	|						КОГДА ККСНГ_СобытияПодписок.Обработано
	|							ТОГДА ДОБАВИТЬКДАТЕ(ККСНГ_СобытияПодписок.Date, ДЕНЬ, 7) < &Date
	|						КОГДА ККСНГ_СобытияПодписок.Счетчик > 0
	|							ТОГДА ДОБАВИТЬКДАТЕ(ККСНГ_СобытияПодписок.Date, ДЕНЬ, 30) < &Date
	|						ИНАЧЕ ЛОЖЬ
	|					КОНЕЦ
	|			ИНАЧЕ ВЫБОР
	|					КОГДА ККСНГ_СобытияПодписок.Обработано
	|						ТОГДА ДОБАВИТЬКДАТЕ(ККСНГ_СобытияПодписок.ДатаЗагрузки, ДЕНЬ, 7) < &Date
	|					КОГДА ККСНГ_СобытияПодписок.Счетчик > 0
	|						ТОГДА ДОБАВИТЬКДАТЕ(ККСНГ_СобытияПодписок.ДатаЗагрузки, ДЕНЬ, 30) < &Date
	|					ИНАЧЕ ЛОЖЬ
	|				КОНЕЦ
	|		КОНЕЦ";	
	
	Запрос.УстановитьПараметр("Code", КодУчастникаЭДО);
	Запрос.УстановитьПараметр("Date", НачалоДня(ТекущаяДатаСеанса()));
	Запрос.УстановитьПараметр("IdПоследнегоСобытия", ПолучитьИдентификаторПоследнегоСобытия(КодУчастникаЭДО));
	
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		ВыборкаСобытий = Результат.Выбрать();
		
		Пока ВыборкаСобытий.Следующий() Цикл
		
			МенеджерЗаписи =  РегистрыСведений.ККСНГ_СобытияПодписок.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ВыборкаСобытий);
					
			Попытка
				МенеджерЗаписи.Удалить();
				Ответ.Результат = Ответ.Результат + 1;
			Исключение	
				Продолжить;	
			КонецПопытки;
			
		КонецЦикла;
		
	КонецЕсли;
	
	ККСНГ_ЛогированиеКлиентСервер.ДобавитьИнформацию(Ответ.Журнал, "Удалено " + Ответ.Результат + " старых событий подписки.");
	
	Возврат Ответ;
	
КонецФункции

#Область ПолучениеСобытийИзКурьера 

Функция ПолучитьИСохранитьСобытияИзПодпискиПакетом(КодУчастникаЭДО, ТокенПодписки, ПараметрыАвторизации, РазмерБлока = 0)
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета();
	
	ЗапросСобытий = ККСНГ_APIКурьер.v2_SubscriptionEventsTotals(ПараметрыАвторизации, ТокенПодписки, РазмерБлока);
	ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросСобытий.Журнал, Ложь);
	
	Если ЗапросСобытий.Успех Тогда
		
		ВсегоСобытийВПодписке = ЗапросСобытий.Результат.Totals;
		События = ЗапросСобытий.Результат.Events.DocumentEvent;
		
		Ответ.Результат = Новый Структура("Количество, Всего", События.Количество(), ВсегоСобытийВПодписке);
		
		ККСНГ_ЛогированиеКлиентСервер.ДобавитьИнформацию(Ответ.Журнал, "Получено событий: " 
																+ XMLСтрока(События.Количество()) 
																	+ " из " + XMLСтрока(ВсегоСобытийВПодписке));
		
		Если События.Количество() > 0 Тогда
			
			СписокСобытийКУдалению = Новый Массив;
			
			Для Каждого Событие Из События Цикл
				
				ЗаписьРегистра = ЗаписатьСобытиеПодписки(КодУчастникаЭДО, ТокенПодписки, Событие.Id, Событие);
				Если ЗаписьРегистра.Успех Тогда
					СписокСобытийКУдалению.Добавить(Событие.Id);
				КонецЕсли;
				
			КонецЦикла;
			
			ККСНГ_ЛогированиеКлиентСервер.ДобавитьИнформацию(Ответ.Журнал, "Сохранено событий: " + События.Количество());
			
			ЗапросУдаления = ККСНГ_APIКурьер.v2_SubscriptionDeleteEvents(ПараметрыАвторизации, ТокенПодписки, СписокСобытийКУдалению);
			ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросУдаления.Журнал, Ложь);
			
			Если ЗапросУдаления.Успех Тогда
				
				Ответ.Успех = Истина;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

Функция ПолучитьИСохранитьСобытияНачинаяСЗаданного(КодУчастникаЭДО, ТокенПодписки, ПараметрыАвторизации, IdСобытия = 0, РазмерПакета = 0)
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета();
		
	ЗапросСобытий = ККСНГ_APIКурьер.v1_events_index(ПараметрыАвторизации, IdСобытия, РазмерПакета);
	ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросСобытий.Журнал, Ложь);
	
	Если ЗапросСобытий.Успех Тогда
		
		СобытияКЗагрузке = ЗапросСобытий.Результат.DocumentEvent;
		СобытияКУдалению = Новый Массив;
		КоличествоКЗагрузке = СобытияКЗагрузке.Количество(); 
		
		ККСНГ_ЛогированиеКлиентСервер.ДобавитьИнформацию(Ответ.Журнал, "Получено событий: " + КоличествоКЗагрузке);
		
		Ответ.Успех = Истина;
		
		Для каждого Событие Из СобытияКЗагрузке Цикл
			
			// смоделировать ошибку
			//Если СобытияКУдалению.Количество() > Цел(КоличествоКЗагрузке/2) Тогда 
			//	Ответ.Успех = Ложь;
			//	ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, "Вызвана ошибка", "RQ-20001");
			//	Прервать;
			//КонецЕсли;	
						
			ЗаписьРегистра = ЗаписатьСобытиеПодписки(КодУчастникаЭДО, ТокенПодписки, Событие.Id, Событие);
					
			Если ЗаписьРегистра.Успех Тогда
				СобытияКУдалению.Добавить(Событие.Id);
				IdСобытия = Макс(IdСобытия, Событие.Id);
			Иначе 
				Ответ.Успех = Ложь;
				Прервать;
			КонецЕсли;
		
		КонецЦикла;	
		
		ККСНГ_ЛогированиеКлиентСервер.ДобавитьИнформацию(Ответ.Журнал, "Сохранено событий: " + СобытияКУдалению.Количество());
		
		Если СобытияКУдалению.Количество() Тогда
			
			ЗапросУдаления = ККСНГ_APIКурьер.v2_SubscriptionDeleteEvents(ПараметрыАвторизации, ТокенПодписки, СобытияКУдалению);
			ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросУдаления.Журнал, Ложь);
			
			//Ответ.Успех = Ответ.Успех И ЗапросУдаления.Успех; 
			
		КонецЕсли;
						
		Ответ.Результат = Новый Структура("Количество, Всего", СобытияКУдалению.Количество(), КоличествоКЗагрузке);
		
	КонецЕсли;
		
	Возврат Ответ;
	
КонецФункции

#КонецОбласти

#Область ОбработкаСобытийИзРегистра

Процедура ОбновитьИнформациюРегистраПоВыборке(Выборка, Ответ, Обработано = Истина, Комментарий = "")
	
	ВыборкаДетальная = Выборка.Выбрать();
	
	Пока ВыборкаДетальная.Следующий() Цикл
		ЗаписьРегистра = ЗаписатьСобытиеПодписки(ВыборкаДетальная.Code, ВыборкаДетальная.Token, ВыборкаДетальная.Id,, Обработано, Комментарий);		
		ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗаписьРегистра.Журнал, Ложь);
		
	КонецЦикла; 	
	
КонецПроцедуры

Процедура ОбновитьИнформациюРегистраИДокументыПоВыборке(ВыборкаПоДокументам, КодУчастникаЭДО, ПараметрыАвторизации, Ответ) 
	
	ЕстьОшибкиВТранзакции = Ложь;
	ОбработатьИсключениеДокументНеПолучен = Ложь;
	
	// Получим профиль
	ПрофильНастройкиЭДО = ККСНГ_ОбъектыИБВызовСервера.ПолучитьПрофильЭДООрганизацииПоКодуЭДО(КодУчастникаЭДО);
	ККСНГ_ЛогированиеКлиентСервер.ДобавитьИнформацию(Ответ.Журнал, "Начало транзакции");
	
	НачатьТранзакцию();
	
	Попытка
		
		// Поиск элемента ККСНГ_ЭлектронныеДокументы
		НайденнаяСсылка = Справочники.ККСНГ_ЭлектронныеДокументы.НайтиПоРеквизиту("Id", ВыборкаПоДокументам.DocumentId, , ПрофильНастройкиЭДО);
		
		// Установить исключительную блокировку
		Если Не НайденнаяСсылка.Пустая() Тогда
			БлокировкаДанных  = Новый БлокировкаДанных;
			ЭлементБлокировки = БлокировкаДанных.Добавить("Справочник.ККСНГ_ЭлектронныеДокументы");
			ЭлементБлокировки.УстановитьЗначение("Ссылка", НайденнаяСсылка);
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			БлокировкаДанных.Заблокировать();
		КонецЕсли;

		// Обновим/запишем документ
		ЗапросПоДокументу = ККСНГ_ДокументооборотВызовСервера.ЗаписатьЭлектронныйДокументПоДаннымИзКурьера(ВыборкаПоДокументам.DocumentId, ПрофильНастройкиЭДО, ПараметрыАвторизации, Истина);
		ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗапросПоДокументу.Журнал, Ложь);
		
		// Документ не получен. Скорее всего, сработал фильтр по входящим
		ОбработатьИсключениеДокументНеПолучен = ЗапросПоДокументу.Успех И ЗапросПоДокументу.Результат = Неопределено;
		Если ОбработатьИсключениеДокументНеПолучен Тогда
			ВызватьИсключение "Документ не получен";
		КонецЕсли;
			
		Если ЗапросПоДокументу.Успех Тогда

			// Если есть информация о квитанциях, то обновим/запишем их
			Если ВыборкаПоДокументам.WithTickets Тогда
				ЭДСсылка = ЗапросПоДокументу.Результат;
				ОбновлениеКвитанций = ККСНГ_ДокументооборотВызовСервера.ОбновитьКвитанцииЭлектронногоДокументаПоДаннымИзКурьера(ЭДСсылка, ПараметрыАвторизации);
				ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ОбновлениеКвитанций.Журнал, Ложь);
				
				// Ошибки квитанций
				Если Не ОбновлениеКвитанций.Успех Тогда
					ЕстьОшибкиВТранзакции = Истина;
				КонецЕсли; 
			КонецЕсли;
			
		Иначе // Ошибки документа
			ЕстьОшибкиВТранзакции = Истина;
		КонецЕсли;
		
		// Обновлять только если все ок
		Если ЕстьОшибкиВТранзакции Тогда
			ВызватьИсключение "Есть ошибки в транзакции";
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
		
		// Собираем в результат массив обработанных документов
		Ответ.Результат.Добавить(ВыборкаПоДокументам.DocumentId);
		ОбновитьИнформациюРегистраПоВыборке(ВыборкаПоДокументам, Ответ);
		ККСНГ_ЛогированиеКлиентСервер.ДобавитьИнформацию(Ответ.Журнал, "Транзакция зафиксирована");
		
	Исключение
		
		ОтменитьТранзакцию();
		Ответ.Успех = Ложь;
		
		Если ОбработатьИсключениеДокументНеПолучен Тогда
			ОбновитьИнформациюРегистраПоВыборке(ВыборкаПоДокументам, Ответ);
		ИначеЕсли ЕстьОшибкиВТранзакции Тогда
			ОбновитьИнформациюРегистраПоВыборке(ВыборкаПоДокументам, Ответ, Ложь, ККСНГ_ЛогированиеКлиентСервер.ОписаниеПоследнейОшибки(Ответ.Журнал));
			ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, "Транзакция отменена", "RQ-20001");
		Иначе
			ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, ОписаниеОшибки(), "RQ-20002");
		КонецЕсли;
		
	КонецПопытки;
	
КонецПроцедуры

Функция ПолучитьСобытияИзРегистраПоКодуУчастникаЭДО(КодУчастникаЭДО)
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета("Запрос данных по событиям из регистра для " + Строка(КодУчастникаЭДО));
	
	ЗапросПоСобытиям = Новый Запрос("ВЫБРАТЬ
	|	ККСНГ_СобытияПодписок.Code КАК Code,
	|	ККСНГ_СобытияПодписок.Token КАК Token,
	|	ККСНГ_СобытияПодписок.Id КАК Id,
	|	ККСНГ_СобытияПодписок.DocumentId КАК DocumentId,
	|	ККСНГ_СобытияПодписок.TicketId КАК TicketId,
	|	0 КАК WithTickets,
	|	ВЫБОР
	|		КОГДА ККСНГ_СобытияПодписок.EventType = ""Created""
	|				И НЕ ККСНГ_ЭлектронныеДокументы.Ссылка ЕСТЬ NULL
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК CreatedOnly,
	|	ВЫБОР
	|		КОГДА ККСНГ_СобытияПодписок.EventType = ""Deleted""
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Deleted,
	|	1 КАК Total
	|ИЗ
	|	РегистрСведений.ККСНГ_СобытияПодписок КАК ККСНГ_СобытияПодписок
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ККСНГ_ЭлектронныеДокументы КАК ККСНГ_ЭлектронныеДокументы
	|		ПО ККСНГ_СобытияПодписок.DocumentId = ККСНГ_ЭлектронныеДокументы.Id
	|			И ККСНГ_СобытияПодписок.Code = ККСНГ_ЭлектронныеДокументы.КодЭДОВладельца
	|ГДЕ
	|	НЕ ККСНГ_СобытияПодписок.Обработано
	|	И ККСНГ_СобытияПодписок.Code = &КодУчастникаЭДО
	|
	|УПОРЯДОЧИТЬ ПО
	|	Id
	|ИТОГИ
	|	МИНИМУМ(Id),
	|	МАКСИМУМ(TicketId) > 0 КАК WithTickets,
	|	СУММА(CreatedOnly) = 0 КАК CreatedOnly,
	|	СУММА(Deleted) > 0 КАК Deleted,
	|	СУММА(Total)
	|ПО
	|	ОБЩИЕ,
	|	DocumentId");
	
	ЗапросПоСобытиям.УстановитьПараметр("КодУчастникаЭДО", КодУчастникаЭДО);
	
	Ответ.Результат = ЗапросПоСобытиям.Выполнить();
	Если Ответ.Результат.Пустой() Тогда
		Ответ.Успех	= Ложь;
	Иначе
		Ответ.Успех	= Истина;
	КонецЕсли; 	
	
	ККСНГ_ЛогированиеКлиентСервер.ДобавитьИнформацию(Ответ.Журнал, "Запрос данных по событиям из регистра для " + Строка(КодУчастникаЭДО) + " выполнен.");
	
	Возврат Ответ;	
	
КонецФункции

#КонецОбласти

#КонецОбласти
